src/blog/lo-idiomatico.org
---
layout: post
title: "Lo idiomático"
date: 2021-04-12
tags: [programación, software]
css: "highlight"
lang: es
---
#+OPTIONS: toc:nil num:nil
#+LANGUAGE: es

La semana pasada circuló [[https://github.com/josevalim/nested-data-structure-traversal][un repositorio de José Valim]] que plantea un problema sencillo de programación (recorrer y "anotar" una estructura de datos anidada) e invita a enviar soluciones usando distintos lenguajes. Fue simpático ver cómo crecían las contribuciones con el correr de las horas.

El ejercicio me pareció interesante porque el problema es suficientemente fácil como para entenderlo y encontrarle una solución rápidamente y después divagar a gusto sobre las distintas formas de expresarla. En particular, me entretuve pensando cómo cambiaría mi propia solución según cuál de los lenguajes que frecuento usara en cada caso. Abajo transcribo algunas ideas que surgieron en el proceso.

Para más contexto, sugiero leer la [[https://github.com/josevalim/nested-data-structure-traversal#the-problem][descripción del problema]]. El código del que extraje los ejemplos siguientes se puede encontrar [[https://github.com/facundoolano/nested-data-structure-traversal][acá]].

*** Python
La solución que escribí en Python es casi idéntica al [[https://github.com/josevalim/nested-data-structure-traversal/blob/bce81f759dcb4c1efa113e3155520099da7cb300/python/for-in.py#L28-L42][ejemplo provisto en el repositorio]], lo que era esperable:

#+begin_src python
section_position = 1
lesson_position = 1
for section in sections:
    section["position"] = section_position
    section_position += 1

    if section["reset_lesson_position"]:
        lesson_position = 1

    for lesson in section["lessons"]:
        lesson["position"] = lesson_position
        lesson_position += 1

print(sections)
#+end_src

Tendría que haber forzado las cosas para llegar a algo diferente.

Encuentro que Python minimiza la distancia entre lo que pienso y lo que termino por escribir. Supongo que se debe en parte a la expresividad del lenguaje pero también a que la forma en que aprendí a razonar cuando estaba empezando a programar se ajusta bastante al estilo imperativo que fomenta Python.

Para ser justo en las comparaciones con los otros lenguajes voy a agregar algunas restricciones: el código no puede estar suelto en el módulo sino que tiene que ser agrupado en funciones; la función que recibe la lista de secciones no puede mutarla sino que tiene que construir una nueva estructura:
#+begin_src python
def traverse(sections):
    result = []
    section_position = 1
    lesson_position = 1
    for section in sections:
        section = {**section, "position": section_position}
        section_position += 1

        if section["reset_lesson_position"]:
            lesson_position = 1

        lessons = []
        for lesson in section["lessons"]:
            lesson = {**lesson, "position": lesson_position}
            lesson_position += 1
            lessons.append(lesson)

        section[lessons] = lessons
        result.append(section)

    return result
#+end_src

