_posts/2021-04-12-lo-idiomatico.html
---
layout: post
title: "Lo idiomático"
date: 2021-04-12
tags: [programación, software]
---

<p>
La semana pasada circuló <a href="https://github.com/josevalim/nested-data-structure-traversal">un repositorio de José Valim</a> que plantea un problema sencillo de programación (recorrer y "anotar" una estructura de datos anidada) e invita a enviar soluciones usando distintos lenguajes. Fue simpático ver cómo crecían las contribuciones con el correr de las horas.
</p>

<p>
El ejercicio me pareció interesante porque el problema es suficientemente fácil como para entenderlo y encontrarle una solución rápidamente y después divagar a gusto sobre las distintas formas de expresarla. En particular, me entretuve pensando cómo cambiaría mi propia solución según cuál de los lenguajes que frecuento usara en cada caso. Abajo transcribo algunas ideas que surgieron en el proceso.
</p>

<p>
Para más contexto, sugiero leer la <a href="https://github.com/josevalim/nested-data-structure-traversal#the-problem">descripción del problema</a>. El código del que extraje los ejemplos siguientes se puede encontrar <a href="https://github.com/facundoolano/nested-data-structure-traversal">acá</a>.
</p>

<div id="outline-container-org2fc874b" class="outline-2">
<h2 id="org2fc874b">Python</h2>
<div class="outline-text-2" id="text-org2fc874b">
<p>
La solución que escribí en Python es casi idéntica al <a href="https://github.com/josevalim/nested-data-structure-traversal/blob/bce81f759dcb4c1efa113e3155520099da7cb300/python/for-in.py#L28-L42">ejemplo provisto en el repositorio</a>, lo que era esperable:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">section_position</span> = 1
<span style="color: #BA36A5;">lesson_position</span> = 1
<span style="color: #0000FF;">for</span> section <span style="color: #0000FF;">in</span> sections:
    <span style="color: #BA36A5;">section</span>[<span style="color: #008000;">"position"</span>] = section_position
    <span style="color: #BA36A5;">section_position</span> += 1

    <span style="color: #0000FF;">if</span> section[<span style="color: #008000;">"reset_lesson_position"</span>]:
        <span style="color: #BA36A5;">lesson_position</span> = 1

    <span style="color: #0000FF;">for</span> lesson <span style="color: #0000FF;">in</span> section[<span style="color: #008000;">"lessons"</span>]:
        <span style="color: #BA36A5;">lesson</span>[<span style="color: #008000;">"position"</span>] = lesson_position
        <span style="color: #BA36A5;">lesson_position</span> += 1

<span style="color: #0000FF;">print</span>(sections)
</pre>
</div>

<p>
Tendría que haber forzado las cosas para llegar a algo diferente.
</p>

<p>
Encuentro que Python minimiza la distancia entre lo que pienso y lo que termino por escribir. Supongo que se debe en parte a la expresividad del lenguaje pero también a que la forma en que aprendí a razonar cuando estaba empezando a programar se ajusta bastante al estilo imperativo que fomenta Python.
</p>

<p>
Para ser justo en las comparaciones con los otros lenguajes voy a agregar algunas restricciones: el código no puede estar suelto en el módulo sino que tiene que ser agrupado en funciones; la función que recibe la lista de secciones no puede mutarla sino que tiene que construir una nueva estructura:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">traverse</span>(sections):
    <span style="color: #BA36A5;">result</span> = []
    <span style="color: #BA36A5;">section_position</span> = 1
    <span style="color: #BA36A5;">lesson_position</span> = 1
    <span style="color: #0000FF;">for</span> section <span style="color: #0000FF;">in</span> sections:
        <span style="color: #BA36A5;">section</span> = {**section, <span style="color: #008000;">"position"</span>: section_position}
        <span style="color: #BA36A5;">section_position</span> += 1

        <span style="color: #0000FF;">if</span> section[<span style="color: #008000;">"reset_lesson_position"</span>]:
            <span style="color: #BA36A5;">lesson_position</span> = 1

        <span style="color: #BA36A5;">lessons</span> = []
        <span style="color: #0000FF;">for</span> lesson <span style="color: #0000FF;">in</span> section[<span style="color: #008000;">"lessons"</span>]:
            <span style="color: #BA36A5;">lesson</span> = {**lesson, <span style="color: #008000;">"position"</span>: lesson_position}
            <span style="color: #BA36A5;">lesson_position</span> += 1
            lessons.append(lesson)

        <span style="color: #BA36A5;">section</span>[lessons] = lessons
        result.append(section)

    <span style="color: #0000FF;">return</span> result
</pre>
</div>
</div>
</div>
