_posts/2021-04-12-lo-idiomatico.html

<div id="outline-container-org916a68a" class="outline-2">
<h2 id="org916a68a">Erlang</h2>
<div class="outline-text-2" id="text-org916a68a">
<p>
La implementación en Erlang, donde los datos son inmutables y no hay sentencias iterativas, me requiere un poco más de esfuerzo mental, aunque con los años me acostumbré a descomponer este tipo de problemas en funciones recursivas. Sé que voy a necesitar una función que procese un elemento de la lista a la vez&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>([<span style="color: #BA36A5;">Section</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #8D8D84;">% </span><span style="color: #8D8D84; font-style: italic;">...</span>
</pre>
</div>

<p>
&#x2026;que voy a tener que acumular los resultados en otra lista y llamar a la misma función con el resto de las secciones&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>([<span style="color: #BA36A5;">Section</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #BA36A5;">Output</span> <span style="color: #8D8D84;">% </span><span style="color: #8D8D84; font-style: italic;">...</span>
    <span style="color: #8D8D84;">%% </span><span style="color: #8D8D84; font-style: italic;">...</span>
    <span style="color: #6434A3;">traverse_sections</span>(<span style="color: #BA36A5;">Rest</span>, [<span style="color: #BA36A5;">SectionWithPositions</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">...</span>
</pre>
</div>

<p>
&#x2026;y que al terminar de procesar las secciones voy a tener que invertir la lista con los resultados, para preservar el orden original:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>([<span style="color: #BA36A5;">Section</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #BA36A5;">Output</span> <span style="color: #8D8D84;">% </span><span style="color: #8D8D84; font-style: italic;">...</span>
    <span style="color: #8D8D84;">%% </span><span style="color: #8D8D84; font-style: italic;">...</span>
    <span style="color: #6434A3;">traverse_sections</span>(<span style="color: #BA36A5;">Rest</span>, [<span style="color: #BA36A5;">SectionWithPositions</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #8D8D84;">%</span><span style="color: #8D8D84; font-style: italic;">....</span>
<span style="color: #006699;">traverse_sections</span>([], <span style="color: #BA36A5;">Output</span>, <span style="color: #8D8D84;">% </span><span style="color: #8D8D84; font-style: italic;">...</span>
    <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>).
</pre>
</div>

<p>
La primera versión me quedó así:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>([<span style="color: #BA36A5;">Section</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">SectionPosition</span>, <span style="color: #BA36A5;">LessonPositon</span>) -&gt;
    {<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">ActualLessonPosition</span>} =
        <span style="color: #0000FF;">case</span> <span style="color: #BA36A5;">Section</span> <span style="color: #0000FF;">of</span>
            #{lessons := <span style="color: #BA36A5;">Lessons</span>, reset_lesson_position := true} -&gt;<span style="color: #006699;"> </span>{<span style="color: #BA36A5;">Lessons</span>, 1};
            #{lessons := <span style="color: #BA36A5;">Lessons</span>} -&gt;<span style="color: #006699;"> </span>{<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">LessonPositon</span>}
        <span style="color: #0000FF;">end</span>,

    {<span style="color: #BA36A5;">LessonsWithPostions</span>, <span style="color: #BA36A5;">NextLessonPosition</span>} =
        <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, [], <span style="color: #BA36A5;">ActualLessonPosition</span>),
    <span style="color: #BA36A5;">SectionWithPositions</span> = <span style="color: #BA36A5;">Section</span>#{position =&gt; <span style="color: #BA36A5;">SectionPosition</span>,
                                    lessons =&gt; <span style="color: #BA36A5;">LessonsWithPostions</span>},

    <span style="color: #6434A3;">traverse_sections</span>(<span style="color: #BA36A5;">Rest</span>, [<span style="color: #BA36A5;">SectionWithPositions</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #BA36A5;">SectionPosition</span> + 1, <span style="color: #BA36A5;">NextLessonPosition</span>);
<span style="color: #006699;">traverse_sections</span>([], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">_</span>) -&gt;
    <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>).

<span style="color: #006699;">traverse_lessons</span>([<span style="color: #BA36A5;">Lesson</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">LessonPosition</span>) -&gt;
    <span style="color: #BA36A5;">LessonWithPosition</span> = <span style="color: #BA36A5;">Lesson</span>#{position =&gt; <span style="color: #BA36A5;">LessonPosition</span>},
    <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Rest</span>, [<span style="color: #BA36A5;">LessonWithPosition</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #BA36A5;">LessonPosition</span> + 1);
<span style="color: #006699;">traverse_lessons</span>([], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">LastLessonPosition</span>) -&gt;
    {<span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>), <span style="color: #BA36A5;">LastLessonPosition</span>}.
</pre>
</div>

<p>
Un poco más engorroso que la versión imperativa, pero nada complicado. Prestando un poco de atención, el <code>case</code> en la primera cláusula me huele mal: en primer lugar porque está haciendo dos cosas a la vez (extraer la lista de lecciones y decidir si se debe resetear la posición), en segundo lugar porque no me gusta hacer con un <code>case</code> lo que se puede hacer con una función auxiliar con pattern-matching en sus argumentos. El resultado:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>([<span style="color: #BA36A5;">Section</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">SectionPosition</span>, <span style="color: #BA36A5;">LessonPosition</span>) -&gt;
    #{lessons := <span style="color: #BA36A5;">Lessons</span>, reset_lesson_position := <span style="color: #BA36A5;">ResetPosition</span>} = <span style="color: #BA36A5;">Section</span>,

    {<span style="color: #BA36A5;">LessonsWithPostions</span>, <span style="color: #BA36A5;">NextLessonPosition</span>} =
        <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">LessonPosition</span>, <span style="color: #BA36A5;">ResetPosition</span>),
    <span style="color: #BA36A5;">SectionWithPositions</span> = <span style="color: #BA36A5;">Section</span>#{position =&gt; <span style="color: #BA36A5;">SectionPosition</span>,
                                    lessons =&gt; <span style="color: #BA36A5;">LessonsWithPostions</span>},

    <span style="color: #6434A3;">traverse_sections</span>(<span style="color: #BA36A5;">Rest</span>, [<span style="color: #BA36A5;">SectionWithPositions</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #BA36A5;">SectionPosition</span> + 1, <span style="color: #BA36A5;">NextLessonPosition</span>);
<span style="color: #006699;">traverse_sections</span>([], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">_</span>) -&gt;
    <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>).

<span style="color: #006699;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">LessonPosition</span>, <span style="color: #BA36A5;">_Reset</span>=false) -&gt;
    <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, [], <span style="color: #BA36A5;">LessonPosition</span>);
<span style="color: #006699;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">_LessonPosition</span>, <span style="color: #BA36A5;">_Reset</span>=true) -&gt;
    <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, [], 1);

<span style="color: #006699;">traverse_lessons</span>([<span style="color: #BA36A5;">Lesson</span> | <span style="color: #BA36A5;">Rest</span>], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">LessonPosition</span>) -&gt;
    <span style="color: #BA36A5;">LessonWithPosition</span> = <span style="color: #BA36A5;">Lesson</span>#{position =&gt; <span style="color: #BA36A5;">LessonPosition</span>},
    <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Rest</span>, [<span style="color: #BA36A5;">LessonWithPosition</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #BA36A5;">LessonPosition</span> + 1);
<span style="color: #006699;">traverse_lessons</span>([], <span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">LastLessonPosition</span>) -&gt;
    {<span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>), <span style="color: #BA36A5;">LastLessonPosition</span>}.
</pre>
</div>

<p>
El código queda menos anidado, lo que considero un indicio de que el cambio es positivo.
</p>

<p>
La misma solución se podría reescribir usando <a href="https://learnyousomeerlang.com/higher-order-functions">funciones de orden superior</a>, en este caso <code>lists:foldl/3</code>, en vez de aplicar recursión "a mano".
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>(<span style="color: #BA36A5;">Sections</span>) -&gt;
    {<span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">_</span>} =
        <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">foldl</span>(
          <span style="color: #0000FF;">fun</span> (<span style="color: #BA36A5;">Section</span>, {<span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">SectionPosition</span>, <span style="color: #BA36A5;">LessonPosition</span>}) -&gt;
                  #{lessons := <span style="color: #BA36A5;">Lessons</span>, reset_lesson_position := <span style="color: #BA36A5;">ResetPosition</span>} = <span style="color: #BA36A5;">Section</span>,
                  {<span style="color: #BA36A5;">LessonsWithPostions</span>, <span style="color: #BA36A5;">NextLessonPosition</span>} =
                      <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">LessonPosition</span>, <span style="color: #BA36A5;">ResetPosition</span>),
                  <span style="color: #BA36A5;">SectionWithPositions</span> = <span style="color: #BA36A5;">Section</span>#{position =&gt; <span style="color: #BA36A5;">SectionPosition</span>,
                                                  lessons =&gt; <span style="color: #BA36A5;">LessonsWithPostions</span>},
                  {[<span style="color: #BA36A5;">SectionWithPositions</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #BA36A5;">SectionPosition</span> + 1, <span style="color: #BA36A5;">NextLessonPosition</span>}
          <span style="color: #0000FF;">end</span>, {[], 1, 1}, <span style="color: #BA36A5;">Sections</span>),
    <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>).
</pre>
</div>

<p>
Si bien son menos líneas de código, esta opción no me termina de convencer: el código resulta más anidado, demasiado denso. Si quisiera extraer la función anónima del <code>foldl</code> y darle su propio nombre, tampoco sería satisfactorio:
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #006699;">traverse_sections</span>(<span style="color: #BA36A5;">Sections</span>) -&gt;
    {<span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">_</span>} =
        <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">foldl</span>(<span style="color: #0000FF;">fun</span> <span style="color: #6434A3;">traverse_section/2</span>, {[], 1, 1}, <span style="color: #BA36A5;">Sections</span>),
    <span style="color: #6434A3;">lists</span>:<span style="color: #6434A3;">reverse</span>(<span style="color: #BA36A5;">Output</span>).

<span style="color: #006699;">traverse_section</span>(<span style="color: #BA36A5;">Section</span>, {<span style="color: #BA36A5;">Output</span>, <span style="color: #BA36A5;">SectionPosition</span>, <span style="color: #BA36A5;">LessonPosition</span>}) -&gt;
    #{lessons := <span style="color: #BA36A5;">Lessons</span>, reset_lesson_position := <span style="color: #BA36A5;">ResetPosition</span>} = <span style="color: #BA36A5;">Section</span>,
    {<span style="color: #BA36A5;">LessonsWithPostions</span>, <span style="color: #BA36A5;">NextLessonPosition</span>} =
        <span style="color: #6434A3;">traverse_lessons</span>(<span style="color: #BA36A5;">Lessons</span>, <span style="color: #BA36A5;">LessonPosition</span>, <span style="color: #BA36A5;">ResetPosition</span>),
    <span style="color: #BA36A5;">SectionWithPositions</span> = <span style="color: #BA36A5;">Section</span>#{position =&gt; <span style="color: #BA36A5;">SectionPosition</span>,
                                    lessons =&gt; <span style="color: #BA36A5;">LessonsWithPostions</span>},
    {[<span style="color: #BA36A5;">SectionWithPositions</span> | <span style="color: #BA36A5;">Output</span>], <span style="color: #BA36A5;">SectionPosition</span> + 1, <span style="color: #BA36A5;">NextLessonPosition</span>}.
</pre>
</div>

<p>
Encuentro que estas funciones "reductoras" son un poco confusas cuando se las separa del llamado a <code>foldl</code>: se oscurece la justificación para empaquetar los argumentos en una tupla (<code>{Output, SectionPosition, LessonPosition}</code>) y al llamar al <code>foldl</code> me veo obligado a descartar elementos del resultado (<code>{Output, _, _}</code>). Desde ya que esto corresponde al gusto personal; ninguna de las opciones anteriores me parece rebuscada, todas podrían calificar de <i>idiomáticas</i>.
</p>
</div>
</div>
