_posts/2021-04-12-lo-idiomatico.html

<div id="outline-container-org425b491" class="outline-2">
<h2 id="org425b491">Lo (no) idiomático</h2>
<div class="outline-text-2" id="text-org425b491">
<p>
¿Qué me impide intercambiar los estilos que usé para Python y Erlang? Salvando las especificidades de cada plataforma, uno podría ensayar una versión funcional en Python usando <code>map</code>, <code>reduce</code> y <code>lambda</code>, así como una versión con estado mutable en Erlang, por ejemplo usando <a href="https://erlang.org/doc/man/counters.html">counters</a><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Esas soluciones serían válidas pero extravagantes, el tipo de código que hace detenerse al lector y preguntar <i>qué es esto</i>. ¿Qué me impide hacerlo? La empatía, la vergüenza. El respeto por el prójimo. Los usos y costumbres. La honestidad intelectual. Lo idiomático.
</p>

<p>
Yo creo que existe el estilo en programación, entendido como las preferencias, la impronta personal del individuo para expresarse a través del código. Existe y es de las cosas que enriquecen al oficio, pero hay que usarlo con moderación. Hablando de proyectos profesionales (es decir, aquellos cuyo objetivo principal es producir software útil y no experimentar o entretenerse), suscribo a la idea de que el estilo apropiado es aquel preexistente en el código sobre el que se trabaja. Pero en ciertos casos no hay código preexistente o lo hay pero no informa el estilo de lo que vamos a escribir; o bien consideramos que el código preexistente es inadecuado y nos disponemos a reemplazarlo. En estos casos hay que apelar a lo idiomático, es decir, usar la herramienta en forma convencional, no exigir un esfuerzo innecesario a quien tenga que leer lo que vamos a escribir. Solo dentro de esos límites me parece aceptable dar lugar al estilo personal.
</p>

<p>
Es cierto que hablar de lo idiomático es meterse en terreno pantanoso. Salvo en casos puntuales, las convenciones no están escritas; refieren a un sentido común discutible, sujeto a interpretación y a cambios en el tiempo. El peligro es convencerse de que existe una única forma correcta de hacer las cosas y que, casualmente, coincide con <i>nuestra</i> forma de hacer las cosas. No queda más que ser autocrítico: ver el código con los ojos del otro, que el código sea visto por otros ojos.
</p>
</div>
</div>

<div id="outline-container-orgd1d04d6" class="outline-2">
<h2 id="orgd1d04d6">Posdata: JavaScript</h2>
<div class="outline-text-2" id="text-orgd1d04d6">
<p>
¿Existe lo idiomático en JavaScript, un lenguaje que es tantos lenguajes? No voy a repetir lo que ya puse en <a href="../2020-09-22-javascript-las-partes-nobles">otro post</a>, pero seguramente hay ciertos consensos sobre lo que <i>no</i> se debe hacer. Lo que es decir que hay buen margen para el propio estilo o, en todo caso, para un estilo consensuado en equipo o en comunidad.
</p>

<p>
Si bien podría escribir una solución casi idéntica a la de Python<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #0000FF;">function</span> <span style="color: #006699;">traverse</span>(<span style="color: #BA36A5;">sections</span>) {
  <span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">result</span> = [];
  <span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">lessonPosition</span> = 1;

  <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">i</span> = 0; i &lt; sections.length; i++) {
    <span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">section</span> = sections[i];

    <span style="color: #0000FF;">if</span> (section.reset_lesson_position) {
      lessonPosition = 1;
    }

    <span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">lessons</span> = [];
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">j</span> = 0; j &lt; section.lessons.length; j++) {
      <span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">lesson</span> = section.lessons[j];
      lesson = {...lesson, position: lessonPosition};
      lessons.push(lesson);
      lessonPosition++;
    }

    section = {...section, position: i + 1, lessons};
    result.push(section);
  }

  <span style="color: #0000FF;">return</span> result;
}
</pre>
</div>

<p>
&#x2026;en mi corazón JavaScript siempre va a ser un lenguaje funcional (<i>the first lambda language to go mainstream</i>):
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #0000FF;">function</span> <span style="color: #006699;">traverse</span>(<span style="color: #BA36A5;">sections</span>) {
  <span style="color: #0000FF;">let</span> <span style="color: #BA36A5;">lessonPosition</span> = 1;
  <span style="color: #0000FF;">return</span> sections.map(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">section</span>, <span style="color: #BA36A5;">i</span>) {

    <span style="color: #0000FF;">if</span> (section.reset_lesson_position) {
      lessonPosition = 1;
    }

    <span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">lessons</span> = section.lessons.map(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">lesson</span>) {
      lesson = {...lesson, position: lessonPosition};
      lessonPosition++;
      <span style="color: #0000FF;">return</span> lesson;
    });

    <span style="color: #0000FF;">return</span> {...section, lessons, position: i + 1};
  }, []);
}
</pre>
</div>

<p>
Me tomé la licencia de mutar la variable externa <code>lessonPosition</code> y así cambiar lo que sería un <code>reduce</code> por un <code>map</code>,
resultando la que probablemente sea la más sencilla de todas las implementaciones que mostré.
</p>

<p>
Claro que todo se puede llevar demasiado lejos. Durante un tiempo tuve cierta fascinación con la biblioteca <a href="https://ramdajs.com/">Ramda.js</a> y produje código que puede gustar o no, pero ciertamente no es idiomático. El mejor ejemplo es el <a href="https://github.com/facundoolano/aso/blob/master/lib/visibility.js">paquete App Store Optimization</a>: lo expresé casi completamente en términos de transformaciones de datos con funciones de Ramda y el resultado, para bien o para mal, fue que todo el mundo se abstuvo para siempre de mandar un Pull-Request a ese proyecto.
</p>
</div>
</div>

<div id="outline-container-orge6c5abb" class="outline-2">
<h2 id="orge6c5abb">Posdata: Ejercicios de estilo</h2>
<div class="outline-text-2" id="text-orge6c5abb">
<p>
Hay un libro que sigue una premisa parecida al repositorio de José Valim. Se llama <a href="https://www.routledge.com/Exercises-in-Programming-Style/Lopes/p/book/9780367350208">Exercises in programming style</a>, inspirado por
el <a href="https://en.wikipedia.org/wiki/Exercises_in_Style">libro de ejercicios de estilo</a> de Raymond Queneau. Ahí se usa Python no en forma idiomática sino como <i>lingua franca</i> para resolver un mismo problema
de muchas maneras posibles y en el proceso hacer un repaso de la historia de la programación.
</p>

<blockquote>
<p>
In the universe of all things a good programmer must know, I see collections of programming styles as being as important as any collection of data structures and algorithms, but with a focus on human effects rather than on computing effects. Programs convey information not just to the computers but, more importantly, to the people who read them. As with any form of expression, the consequences of <b>what</b> is being said are shaped and influenced by <b>how</b> they are being said. An advanced programmer needs not be able to just write correct programs that perform well; he/she needs to be able to choose appropriate styles for expressing those programs for a variety of purposes.
</p>
</blockquote>

<p>
Los ejercicios se pueden ver <a href="https://github.com/crista/exercises-in-programming-style">en este repositorio</a>.
</p>
</div>
</div>
<div id="footnotes">
<!--h2 class="footnotes">Nota al pie de p&aacute;gina: </h2-->
<h2 class="footnotes">Notas: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
En esta línea, por ejemplo, hay soluciones en Elixir <a href="https://github.com/josevalim/nested-data-structure-traversal/blob/bce81f759dcb4c1efa113e3155520099da7cb300/elixir/ets_for.exs">usando tablas ETS</a> y en Clojure <a href="https://github.com/josevalim/nested-data-structure-traversal/blob/bce81f759dcb4c1efa113e3155520099da7cb300/clojure/atom.clj">usando atoms</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
En el repositorio de Valim hay una <a href="https://github.com/josevalim/nested-data-structure-traversal/blob/bce81f759dcb4c1efa113e3155520099da7cb300/javascript/for_of.js">solución imperativa</a> bastante más limpia usando <code>for ... of</code>.
</p></div></div>


</div>
</div>
